/* Copyright (c) 2011 - 2012 Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of Freescale Semiconductor nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 *
 * ALTERNATIVELY, this software may be distributed under the terms of the
 * GNU General Public License ("GPL") as published by the Free Software
 * Foundation, either version 2 of that License or (at your option) any
 * later version.
 *
 * THIS SOFTWARE IS PROVIDED BY Freescale Semiconductor ``AS IS'' AND ANY
 * EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL Freescale Semiconductor BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES

        (descriptor)->key2_cmd.command.field.length = (len);    \
        (descriptor)->key2_ptr = g_sec_vtop((key));             \
}

#define PDCP_JD_SET_IN_PTR(descriptor,phys_addr,offset,length) {    \
    (descriptor)->seq_in_ptr = (phys_addr) + (offset);              \
    (descriptor)->in_ext_length = (length);                         \
}

#define PDCP_JD_SET_OUT_PTR(descriptor,phys_addr,offset,length) {   \
    (descriptor)->seq_out_ptr = (phys_addr) + (offset);             \
    (descriptor)->out_ext_length = (length);                        \
}

#define PDCP_JD_SET_SG_IN(descriptor)   ( (descriptor)->seq_in.command.field.sgf =  1 )

#define PDCP_JD_SET_SG_OUT(descriptor)  ( (descriptor)->seq_out.command.field.sgf = 1 )

#define SEC_PDCP_SH_SET_PROT_DIR(descriptor,dir)    ( (descriptor)->protocol.command.field.optype = \
                        ((dir) == PDCP_ENCAPSULATION) ? CMD_PROTO_ENCAP : CMD_PROTO_DECAP )

#define SEC_PDCP_SH_SET_PROT_ALG(descriptor,alg)    ( (descriptor)->protocol.command.field.protinfo = \
                        (alg == SEC_ALG_SNOW) ? CMD_PROTO_SNOW_ALG : (alg == SEC_ALG_AES) ? \
                         CMD_PROTO_AES_ALG : CMD_PROTO_SNOW_ALG )

#define SEC_PDCP_GET_DESC_LEN(descriptor)                                                   \
    (((struct descriptor_header_s*)(descriptor))->command.sd.ctype ==                       \
    CMD_HDR_CTYPE_SD ? ((struct descriptor_header_s*)(descriptor))->command.sd.desclen :    \
                       ((struct descriptor_header_s*)(descriptor))->command.jd.desclen )

#define SEC_PDCP_DUMP_DESC(descriptor) {                                    \
        int __i;                                                            \
        SEC_DEBUG("Descriptor @ 0x%08x",(uint32_t)((uint32_t*)(descriptor)));\
        for( __i = 0;                                                       \
            __i < SEC_PDCP_GET_DESC_LEN(descriptor);                        \
            __i++)                                                          \
        {                                                                   \
            SEC_DEBUG("0x%08x: 0x%08x",                                     \
                     (uint32_t)(((uint32_t*)(descriptor)) + __i),           \
                     *(((uint32_t*)(descriptor)) + __i));                   \
        }                                                                   \
}

#endif // SEC_HW_VERSION_3_1

/*==============================================================================
                                    ENUMS
==============================================================================*/

/*==============================================================================
                         STRUCTURES AND OTHER TYPEDEFS
==============================================================================*/
/** Forward structure declaration */
typedef struct sec_job_ring_t sec_job_ring_t;

#ifdef SEC_HW_VERSION_3_1
/** SEC Descriptor pointer entry */
struct sec_ptr {
    uint16_t len;       /*< length */
    uint8_t j_extent;   /*< jump to sg link table and/or extent */
    uint8_t eptr;       /*< extended address */
    uint32_t ptr;       /*< address */
};

/** A descriptor that instructs SEC engine how to process a packet.
 * On SEC 3.1 a descriptor consists of 8 double-words:
 * one header dword and seven pointer dwords. */
struct sec_descriptor_t
{
    volatile uint32_t hdr;      /*< header high bits */
    uint32_t hdr_lo;            /*< header low bits */
    struct sec_ptr ptr[7];      /*< ptr/len pair array */
    /*< Initialization Vector. Need to have it here because it
     * is updated with info from each packet!!! */
    uint32_t __CACHELINE_ALIGNED iv[SEC_IV_MAX_LENGTH];

} __CACHELINE_ALIGNED;

/** Cryptographic data belonging to a SEC context.
 * Can be considered a joint venture between:
 * - a 'shared descriptor' (the descriptor header word)
 * - a PDB(protocol data block) */
typedef struct sec_crypto_pdb_s
{
    uint32_t crypto_hdr;    /*< Higher 32 bits of Descriptor Header dword, used for encrypt/decrypt operations.
                                Lower 32 bits are reserved and unused. */
    uint32_t auth_hdr;      /*< Higher 32 bits of Descriptor Header dword, used for authentication operations.
                                Lower 32 bits are reserved and unused. */
    uint32_t iv_template[SEC_IV_TEMPLATE_MAX_LENGTH];       /*< Template for Initialization Vector.
                                                                HFN is stored and maintained here. */
    uint32_t hfn_threshold; /*< Threshold for HFN configured by User Application.
                                Bitshifted left to skip SN bits from first word of IV. */
    uint32_t hfn_mask;      /*< Mask applied on IV to extract HFN */
    uint32_t sn_mask;       /*< Mask applied on PDCP header to extract SN */
    uint8_t sns;            /*< SN Short. Is set to 1 if short sequence number is used:
                                - 5 bit for PDCP c-plane and 7 bit for PDCP d-plane.
                                Is set to 0 if long SN is used:
                                - 12 bit for PDCP d-plane */
    uint8_t pdcp_hdr_len;   /*< Length in bytes for PDCP header. */
    uint8_t is_inbound;     /*< Is #TRUE for inbound data flows(performing decapsulation on packets)
                                and #FALSE for outbound data flows(performing encapsulation on packets). */

}sec_crypto_pdb_t;

#else // SEC_HW_VERSION_3_1

/** Union describing the possible error codes that
 * can be set in the descriptor status word
 */
union hw_error_code{
    uint32_t    error;
    union{
        struct{
            uint32_t    ssrc:4;
            uint32_t    ssed_val:28;
        }PACKED value;
        struct {
            uint32_t    ssrc:4;
            uint32_t     res:28;
        }PACKED no_status_src;
        struct {
            uint32_t    ssrc:4;
            uint32_t    jmp:1;
            uint32_t    res:11;
            uint32_t    desc_idx:8;
            uint32_t    cha_id:4;
            uint32_t    err_id:4;
        }PACKED ccb_status_src;
        struct {
            uint32_t    ssrc:4;
            uint32_t    jmp:1;
            uint32_t    res:11;
            uint32_t    desc_idx:8;
            uint32_t    offset:8;
        }PACKED jmp_halt_user_src;
        struct {
            uint32_t    ssrc:4;
            uint32_t    jmp:1;
            uint32_t    res:11;
            uint32_t    desc_idx:8;
            uint32_t    desc_err:8;
        }PACKED deco_src;
        struct {
            uint32_t    ssrc:4;
            uint32_t    res:17;
            uint32_t    naddr:3;
            uint32_t    desc_err:8;
        }PACKED jr_src;
        struct {
            uint32_t    ssrc:4;
            uint32_t    jmp:1;
            uint32_t    res:11;
            uint32_t    desc_idx:8;
            uint32_t    cond:8;
        }PACKED jmp_halt_cond_src;
    }PACKED error_desc;
}PACKED;

/** Union describing a descriptor header.
 */
struct descriptor_header_s {
    union {
        uint32_t word;
        struct {
            /* 4  */ unsigned int ctype:5;
            /* 5  */ unsigned int res1:2;
            /* 7  */ unsigned int dnr:1;
            /* 8  */ unsigned int one:1;
            /* 9  */ unsigned int res2:1;
            /* 10 */ unsigned int start_idx:6;
            /* 16 */ unsigned int res3:2;
            /* 18 */ unsigned int cif:1;
            /* 19 */ unsigned int sc:1;
            /* 20 */ unsigned int pd:1;
            /* 21 */ unsigned int res4:1;
            /* 22 */ unsigned int share:2;
            /* 24 */ unsigned int res5:2;
            /* 26 */ unsigned int desclen:6;
        } sd;
        struct {
            /* 4  */ unsigned int ctype:5;
            /* 5  */ unsigned int res1:1;
            /* 6  */ unsigned int rsms:1;
            /* 7  */ unsigned int dnr:1;
            /* 8  */ unsigned int one:1;
            /* 9  */ unsigned int res2:1;
            /* 10 */ unsigned int shr_desc_len:6;
            /* 16 */ unsigned int zero:1;
            /* 17 */ unsigned int td:1;
            /* 18 */ unsigned int mtd:1;
            /* 19 */ unsigned int shr:1;
            /* 20 */ unsigned int reo:1;
            /* 21 */ unsigned int share:3;
            /* 24 */ unsigned int res4:1;
            /* 25 */ unsigned int desclen:7;
        } jd;
    } PACKED command;
} PACKED;

/** Union describing a KEY command in a descriptor.
 */
struct key_command_s {
    union {
        uint32_t word;
        struct {
            unsigned int ctype:5;
            unsigned int cls:2;
            unsigned int sgf:1;
            unsigned int imm:1;
            unsigned int enc:1;
            unsigned int nwb:1;
            unsigned int ekt:1;
            unsigned int kdest:4;
            unsigned int tk:1;
            unsigned int rsvd1:5;
            unsigned int length:10;
        } PACKED field;
    } PACKED command;
} PACKED;

/** Union describing a PROTOCOL command
 * in a descriptor.
 */
struct protocol_operation_command_s {
    union {
        uint32_t word;
        struct {
            unsigned int ctype:5;
            unsigned int optype:3;
            unsigned char protid;
            unsigned short protinfo;
        } PACKED field;
    } PACKED command;
} PACKED;

